[ArmoredViper X2CharacterTemplate]
strCharacterName="Armored Viper"

[ArmoredPsiViper X2CharacterTemplate]
strCharacterName="Armored Psi Viper"

[VorpalBlade X2WeaponTemplate]
FriendlyName="Viper Vorpal Blade"

[ArmoredViper_WPN X2WeaponTemplate]
FriendlyName="Viper Gatling Rifle"

[ArmoredPsiViper_WPN X2WeaponTemplate]
FriendlyName="Viper Gatling Psi Rifle"

[CorpseArmoredViper X2ItemTemplate]
FriendlyName="<font color='#C14D0F'>Armored Viper Corpse</font>"
FriendlyNamePlural="<font color='#DA0F0F'>Armored Viper Corpses</font>"
BriefSummary="The Armored Viper is much stronger and harder to take down. Its Armor gives it an immunity to fire as well as some protection to explosives."

[AutopsyArmoredViper X2TechTemplate]
DisplayName="<font color='#C14D0F'>Armored Viper Autopsy</font>"
Summary="Armored Vipers have proven to be a deadly enemy and are much more of a threat to our soldier then lesser known Viper enemies."
CodeName="Armor Hide"
LongDescription="This new Viper is much more of a threat than others we have faced. It would seem that these Vipers are actually male and not female like the others. This discovery is not good for XCom Commander. Have the Elders been waiting to unleash these Vipers only in extreme circumstances? Let us hope these things do not show up in numbers like the females. R. Tygan."

[CorpseArmoredPsiViper X2ItemTemplate]
FriendlyName="<font color='#9536DF'>Armored Psi Viper Corpse</font>"
FriendlyNamePlural="<font color='#9536DF'>Armored Psi Viper Corpses</font>"
BriefSummary="The Armored Psi Viper is much like the lesser Armored Viper. Its armor grants it an immunity to fire as well as some protection to explosives. This Viper also has limited Psi capabilities"

[AutopsyArmoredPsiViper X2TechTemplate]
DisplayName="<font color='#9536DF'>Armored Psi Viper Autopsy</font>"
Summary="The Armored Psi Vipers have limited Psi Powers but are an even greater threat than their non-psionic counterparts."
CodeName="Iron Hide"
LongDescription="The Armored Psi Viper is also male like the non-psionic counterparts. The armor they use, grants an immunity to fire and some protection to explosives like the others, but also grants a resistance to mental attacks. The psionic weapons they carry, and their psionic abilities, make these creatures very difficult opponents that I would recommend our troops prioritize whenever encountered on the battlefield. R. Tygan."

[PsiSpit X2AbilityTemplate]
LocFriendlyName="Psi Spit"
LocLongDescription="A psionic spit attack on a single target that can cause the target to become Disoriented, Panic or become Mind Controled."
LocHelpText="Spits a psionic attack at a single target."
LocFlyOverText="Psi Spit"

[VorpalSlash X2AbilityTemplate]
LocFriendlyName="Vorpal Slash"
LocLongDescription="Slashes a target dealing damage that ignores armor and shields. Is a free action."
LocHelpText="Slash at a single target."
LocFlyOverText="Vorpal Slash at target."

[XCOM_VorpalBlade X2WeaponTemplate]
FriendlyName="Vorpal Blade"
FriendlyNamePlural="Vorpal Blades"
BriefSummary="The Vorpal Blade has a damage output similar to our Fusion Blade. It grants a special Vorpal Slash ability that ignores all armor and shields to deal full damage to the target, dealing fire damage."
TacticalText="<bullet/> Vorpal Slash has a 3 turn cooldown."
AbilityDescName="Vorpal Blade"

[GatlingRifle_XC X2WeaponTemplate]
FriendlyName="Gatling Beam Rifle"
FriendlyNamePlural="Gatling Beam Rifles"
BriefSummary="We can now develop Gatling Beam Rifles. An alien beam weapon heavier than their standard rifle with a higher damage output and the capability to shred armor."
TacticalText="<Bullet/> The Plasma Gatling Rifle is a supremely powerful primary weapon system.\n<Bullet/> Firing the primary weapon always ends the soldier's turn.\n<Bullet/> Shreads armor."
AbilityDescName="Gattling Beam Rifle"

[GatlingVorpalRifle_XC X2WeaponTemplate]
FriendlyName="Gatling Vorpal Rifle"
FriendlyNamePlural="Gatling Vorpal Rifles"
BriefSummary="We can now develop Gatling Vorpal Rifles. An alien beam weapon heavier than their standard rifle with a higher damage output and special beam technology that bypasses armor."
TacticalText="<Bullet/> The Vorpal Gatling Rifle is a supremely powerful primary weapon system.\n<Bullet/> Firing the primary weapon always ends the soldier's turn.\n<Bullet/> Bypass armor with vorpal plasma technology."
AbilityDescName="Gattling Vorpal Rifle"



